Retrieves the description of the failure.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public string GetDescriptionText()
  Visual Basic
Public Function GetDescriptionText As String
  Visual C++
public:
String^ GetDescriptionText()
 Return Value
 The description text.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions InvalidOperationException   |   This FailureMessageAccessor has not been properly initialized.
 See Also
  FailureMessageAccessor Class
  Autodesk.Revit.DB Namespace